In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [3]:
df_new = df[['OdName','AreaName',1980]]
df_new = df_new.head()
df_OdName = df[['OdName','AreaName',1980,1981]].head().set_index('OdName')

# Always need to Delete entire ROW

#### Single Row Deletion

In [4]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [5]:
df_new.drop(1)  # ROW will be delete based on Index only

           OdName AreaName  1980
0     Afghanistan     Asia    16
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [7]:
df_OdName

               AreaName  1980  1981
OdName
Afghanistan        Asia    16    39
Albania          Europe     1     0
Algeria          Africa    80    67
American Samoa  Oceania     0     1
Andorra          Europe     0     0

In [9]:
df_OdName.drop("Albania")

               AreaName  1980  1981
OdName
Afghanistan        Asia    16    39
Algeria          Africa    80    67
American Samoa  Oceania     0     1
Andorra          Europe     0     0

#### Multiple ROW Deletion

In [10]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [12]:
df_new.drop([1,2])  # Need to pass index values as a List

           OdName AreaName  1980
0     Afghanistan     Asia    16
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [13]:
df_OdName

               AreaName  1980  1981
OdName
Afghanistan        Asia    16    39
Albania          Europe     1     0
Algeria          Africa    80    67
American Samoa  Oceania     0     1
Andorra          Europe     0     0

In [14]:
df_OdName.drop(["Algeria", "Albania"])

               AreaName  1980  1981
OdName
Afghanistan        Asia    16    39
American Samoa  Oceania     0     1
Andorra          Europe     0     0